//==============================================================================
// Filename: Graphics.h
// Description:
// Copyright (C) 2022 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================
#pragma once

class GraphicsCube
{
public:
	//---------------------------------------------
	/// èâä˙âªèàóù 
	/// 
	/// \return	none
	//---------------------------------------------
	void Init();

	//---------------------------------------------
	/// èIóπèàóù 
	/// 
	/// \return	none
	//---------------------------------------------
	void Uninit();

	//---------------------------------------------
	/// ï`âÊèàóù 
	/// 
	/// \return	none
	//---------------------------------------------
	void Draw();


private:
	//--------------------------------------------------------------------------
	Microsoft::WRL::ComPtr<ID3D12Resource>		m_vertexBuffer;
	Microsoft::WRL::ComPtr<ID3D12Resource>		m_worldBuffer;

	float angle;
	//--------------------------------------------------------------------------

	/// <summary>
	/// ID3D12Resource		m_vertexBuffer;
	/// </summary>
};

